<details><summary>Digger run report at 2023-07-28 09:33:31 (UTC)</summary>
  <details><summary>Apply for <b>diggerhq/drift-detection-demo#prod</b></summary>
  
```terraform
Terraform will perform the following actions:

  # aws_security_group.allow_tls will be created
  + resource "aws_security_group" "allow_tls" {
      + arn                    = (known after apply)
      + description            = "Allow TLS inbound traffic"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "172.30.0.0/16",
                ]
              + description      = "TLS from VPC"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
      + name                   = "allow_tls_prod"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-089be2add61f9704f"
    }

Plan: 1 to add, 0 to change, 0 to destroy.
aws_security_group.allow_tls: Creating...
aws_security_group.allow_tls: Creation complete after 2s [id=sg-0ddd2117b3db284f4]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

  ```
</details>
</details>